Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.View)
Creates a new instance of panel schedule on sheet and adds it to the document.
Returns:
The newly created panel schedule sheet instance element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.ScheduleId
The panel schedule id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.Origin
The sheet instance offset in drawing sheet coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011